/******************************************************************************/
/**
 * \file        rtc.c
 *
 * \author      Алексей Олехнович <olehnovich@starline.ru>
 *
 * \date        28.12.2015
 *
 * \brief       см. файл реализации
 *
 * \copyright   ООО "НПО "СтарЛайн", 2015. Все права защищены.
 *
 ******************************************************************************/

#ifndef _RTC_H_
#define _RTC_H_

/******************************************************************************
 *                             ЗАГОЛОВОЧНЫЕ ФАЙЛЫ
 ******************************************************************************/

#include <stdbool.h>
#include <stdint.h>

/******************************************************************************
 *                         ГЛОБАЛЬНЫЕ МАКРООПРЕДЕЛЕНИЯ
 ******************************************************************************/
/******************************************************************************
 *                           ГЛОБАЛЬНЫЕ ТИПЫ ДАННЫХ
 ******************************************************************************/


///
/// \brief Дни недели, начиная с ПН
///
typedef enum
{
    RTC_WEEKDAY_MO = 1,
    RTC_WEEKDAY_TU,
    RTC_WEEKDAY_WE,
    RTC_WEEKDAY_TH,
    RTC_WEEKDAY_FR,
    RTC_WEEKDAY_SA,
    RTC_WEEKDAY_SU
} rtc_weekday_t;


///
/// \brief Месяцы
///
typedef enum
{
    RTC_MONTH_JAN = 0,
    RTC_MONTH_FEB,
    RTC_MONTH_MAR,
    RTC_MONTH_APR,
    RTC_MONTH_MAY,
    RTC_MONTH_JUNE,
    RTC_MONTH_JULY,
    RTC_MONTH_AUG,
    RTC_MONTH_SEPT,
    RTC_MONTH_OCT,
    RTC_MONTH_NOV,
    RTC_MONTH_DEC
} rtc_month_t;


///
/// \brief Структура, хранящая дату и время
///
typedef __packed struct
{
    uint16_t      year;     ///< год
    rtc_month_t   month;    ///< месяц
    uint8_t       monthday; ///< число месяца
    rtc_weekday_t weekday;  ///< день недели
    uint8_t       hour;     ///< часы
    uint8_t       minute;   ///< минуты
    uint8_t       second;   ///< секунды
    uint16_t      milsec;   ///< миллискунды
} rtc_date_t;


/******************************************************************************
 *                              ГЛОБАЛЬНЫЕ ДАННЫЕ
 ******************************************************************************/
/******************************************************************************
 *                        ПРОТОТИПЫ ГЛОБАЛЬНЫХ ФУНКЦИЙ
 ******************************************************************************/

extern bool rtc_msec_to_date(rtc_date_t *date, uint64_t  msec);
extern bool rtc_date_to_msec(rtc_date_t *date, uint64_t *msec);

#endif  // _RTC_H_

/******************************************************************************
 *                                 КОНЕЦ ФАЙЛА
 ******************************************************************************/

